In [1]:
import pandas as pd

In [2]:
activity = pd.DataFrame({
    'player_id': [1, 1, 2, 3, 3],
    'device_id': [2, 2, 3, 1, 4],
    'event_date': ['2016-03-01', '2016-05-02', '2017-06-25', '2016-03-02', '2018-07-03'],
    'games_played': [5, 6, 1, 0, 5]
})

In [3]:
activity

   player_id  device_id  event_date  games_played
0          1          2  2016-03-01             5
1          1          2  2016-05-02             6
2          2          3  2017-06-25             1
3          3          1  2016-03-02             0
4          3          4  2018-07-03             5

In [5]:
activity.groupby(by = 'player_id').agg(first_login = ('event_date', 'min')).reset_index()

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02